/* //看了E:\C语言平时练习\summer2007\Contest 4\从noi2001两道题看最优化问题BFS与DFS算法的优化.files */
#include <stdio.h>
#include <stdlib.h>
#define MIN(a,b) ((a<b)?a:b)
struct status{
    int a[4];
    int b;
}s[24]={{1,2,3,4,0},{1,2,4,3,1},{1,3,2,4,1},{1,3,4,2,2},{1,4,2,3,2},{1,4,3,2,3},
        {2,1,3,4,1},{2,1,4,3,2},{2,3,1,4,2},{2,3,4,1,3},{2,4,1,3,3},{2,4,3,1,4},
        {3,1,2,4,2},{3,1,4,2,3},{3,2,1,4,3},{3,2,4,1,4},{3,4,1,2,4},{3,4,2,1,5},
        {4,1,2,3,3},{4,1,3,2,4},{4,2,1,3,4},{4,2,3,1,5},{4,3,1,2,5},{4,3,2,1,6},};
int main()
{
    int re,i,j,t,tt,min;
    char x[10],y[10];

    scanf("%d",&re);
    while(re--){
        min=40;
        scanf("%s%s",x,y);
        for(i=0;i<24;i++){
            t=s[i].b;
            for(j=0;j<4;j++){
                tt=abs((int)x[s[i].a[j]-1]-y[j]);
                t+=MIN(tt,9-tt);
            }
            min=MIN(min,t);
        }
        printf("%d\n",min);
    }
}
/* //2546601 2007-07-31 21:58:33 Accepted 2416 C 00:00.00 2984K わたし */

// 2012-09-07 01:22:34 | Accepted | 2416 | C | 0 | 160 | watashi | Source
